//********************学校：山东科技大学*****************************//
//********************专业：电子信息科学与技术***********************//
//********************姓名：巩光众***********************************//
//********************指导教师：张小军*******************************//
//********************题目：CNN算法的FPGA加速器实现******************//
//********************日期：2019.06.01*******************************//
//********************未经允许，禁止转载*****************************//

//软件复位信号设置
module rst_gen(
	clk,
	rst_0, 
	rst
);

input clk;
input rst_0;  //按键复位信号
output reg rst; //软件复位信号

integer count;  //同步信号

always @(posedge clk)
begin
	if(rst_0) begin
		count = 0;
		rst   = 1;
	end
	
	else begin
		count = count + 1;
		if(count>9) begin
			rst = 0;
			count = 9;
		end
	end
end

endmodule